export const shapesEmoji = [
    {
        emoji: `🟥
                🟥 
                🟥`, //1
        rotates: 1,
    },
    {
        emoji: "🟥🟥🟥",
        rotates: 1,
    },
    {
        emoji: `🟥
                🟥`, //1
        rotates: 1,
    },
    {
        emoji: "🟥", //2 - 80
        rotates: 0,
    },
    {
        emoji: `🟥🟥
                ⬜🟥`, //2-80
        rotates: 3,
    },
    {
        emoji: `🟥⬜
                🟥🟥`,
        rotates: 3,
    },
    {
        emoji: `⬜🟥
                🟥🟥`,
        rotates: 3,
    },
    {
        emoji: `🟥⬜
                🟥🟥`,
        rotates: 3,
    },
    {
        emoji: `🟥🟥
                🟥⬜`,
        rotates: 3,
    },
    {
        emoji: `🟥🟥
                🟥🟥`, //3 - 220
        rotates: 0,
    },
    {
        emoji: `🟥🟥🟥
                ⬜🟥⬜`,
        rotates: 3,
    },
    {
        emoji: `🟥
                🟥
                🟥
                🟥`, //4 - 400
        rotates: 1,
    },
    {
        emoji: "🟥🟥🟥🟥",
        rotates: 1,
    },
    {
        emoji: `🟥⬜⬜
                🟥⬜⬜       
                🟥🟥🟥`,
        rotates: 3,
    },
    {
        emoji: `⬜⬜🟥
                ⬜⬜🟥     
                🟥🟥🟥`,
        rotates: 3,
    },
    {
        emoji: `🟥🟥🟥
                🟥⬜⬜     
                🟥⬜⬜`,
        rotates: 3,
    },
    {
        emoji: `🟥🟥🟥
                ⬜⬜🟥 
                ⬜⬜🟥`, // - 3000
        rotates: 3,
    },

    {
        emoji: `🟥🟥🟥
                🟥🟥🟥
                🟥🟥🟥`, // - 5000
        rotates: 0,
    },

    {
        emoji: `🟥🟥⬜
                ⬜🟥🟥`,
        rotates: 1,
    },

    {
        emoji: `⬜🟥🟥
                🟥🟥⬜`,
        rotates: 1,
    },

    {
        emoji: `🟥🟥🟥
                🟥⬜⬜`,
        rotates: 3,
    },

    {
        emoji: `⬜🟥
                🟥🟥`,
        rotates: 3,
    },
    {
        emoji: `🟥🟥🟥
                ⬜🟥⬜`,
        rotates: 3,
    },
    {
        emoji: `⬜🟥🟥
                🟥🟥⬜`,
        rotates: 1,
    },
    {
        emoji: `🟥🟥⬜
                ⬜🟥🟥`,
        rotates: 1,
    },
    {
        emoji: "🟥🟥",
        rotates: 1,
    },
];
//5 -> 5000
