export const shapesRotations = [
    {
        name: "L3x3",
        rotations: [
            `🟥⬜⬜
             🟥⬜⬜
             🟥🟥🟥`,

            `⬜⬜🟥
             ⬜⬜🟥
             🟥🟥🟥`,

            `🟥🟥🟥
             ⬜⬜🟥
             ⬜⬜🟥`,

            `🟥🟥🟥
             🟥⬜⬜
             🟥⬜⬜`,
        ],
    },

    {
        name: "T3x3",
        rotations: [
            `🟥🟥🟥
             ⬜🟥⬜`,

            `⬜🟥
             🟥🟥
             ⬜🟥`,

            `⬜🟥⬜
             🟥🟥🟥`,

            `🟥⬜
             🟥🟥
             🟥⬜`,
        ],
    },

    {
        name: "I",
        rotations: [
            `🟥
             🟥
             🟥
             🟥`,

            `🟥🟥🟥🟥`,
        ],
    },
    {
        name: "i",
        rotations: [
            `🟥
             🟥
             🟥`,

            `🟥🟥🟥`,
        ],
    },

    { name: "dot", rotations: [`🟥`] },

    // {
    //     name: "bigBox",
    //     rotations: [
    //         `🟥🟥🟥
    //          🟥🟥🟥
    //          🟥🟥🟥`,
    //     ],
    // },
    {
        name: "box",
        rotations: [
            `🟥🟥
             🟥🟥`,
        ],
    },
    {
        name: "Z",
        rotations: [
            `🟥🟥⬜
             ⬜🟥🟥`,

            `⬜🟥
             🟥🟥
             🟥⬜`,

            `⬜🟥🟥
             🟥🟥⬜`,

            `🟥⬜
             🟥🟥
             ⬜🟥`,
        ],
    },

    {
        name: "U",
        rotations: [
            `🟥⬜
             🟥🟥`,

            `🟥🟥
             🟥⬜`,

            ` 🟥🟥
              🟥⬜`,

            `🟥🟥
             ⬜🟥`,
        ],
    },

    {
        name: "SmallT",
        rotations: [
            `🟥🟥🟥
             ⬜🟥⬜`,

            `⬜🟥
             🟥🟥
             ⬜🟥`,

            `⬜🟥⬜
             🟥🟥🟥`,

            `🟥⬜
             🟥🟥
             🟥⬜`,
        ],
    },

    {
        name: "TwoBlock",
        rotations: [
            `🟥🟥`,

            `🟥
             🟥`,
        ],
    },
];
